___

<a href='http://www.pieriandata.com'><img src='../Pierian_Data_Logo.png'/></a>
___
<center><em>Copyright by Pierian Data Inc.</em></center>
<center><em>For more information, visit us at <a href='http://www.pieriandata.com'>www.pieriandata.com</a></em></center>

# Combining DataFrames

## Full Official Guide (Lots of examples!)

### https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

-------
-------

In [1]:
import numpy as np
import pandas as pd

## Concatenation

Directly  "glue" together dataframes.

In [2]:
data_one = {'A': ['A0', 'A1', 'A2', 'A3'],'B': ['B0', 'B1', 'B2', 'B3']}

In [3]:
data_two = {'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}

In [4]:
one = pd.DataFrame(data_one)

In [5]:
two = pd.DataFrame(data_two)

In [6]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [7]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [15]:
pd.concat([one,two],axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [16]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [18]:
two.columns = one.columns

In [19]:
two

    A   B
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [22]:
mydf = pd.concat([one,two],axis=0)

In [24]:
mydf.index = range(len(mydf))

In [25]:
mydf

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3

In [31]:
registrations_dict = {'reg_id': ['0', '1', '2', '3'],'name': ['Andrew', 'Bob', 'Charlie', 'David']}

In [32]:
logins_dict = {'log_id': ['0', '1', '2', '3'],'name': ['Xavier', 'Andrew', 'Yolanda', 'Bob']}

In [33]:
reg_df = pd.DataFrame.from_dict(registrations_dict)

reg_df

In [34]:
reg_df

  reg_id     name
0      0   Andrew
1      1      Bob
2      2  Charlie
3      3    David

In [35]:
log_df = pd.DataFrame.from_dict(logins_dict)

In [36]:
pd.merge(reg_df, log_df, how="inner", on="name")

  reg_id    name log_id
0      0  Andrew      1
1      1     Bob      3

In [37]:
pd.merge(reg_df, log_df, how="outer", on="name")

  reg_id     name log_id
0      0   Andrew      1
1      1      Bob      3
2      2  Charlie    NaN
3      3    David    NaN
4    NaN   Xavier      0
5    NaN  Yolanda      2

In [44]:
pd.merge(log_df, reg_df, how="outer", on="name")

  log_id     name reg_id
0      0   Xavier    NaN
1      1   Andrew      0
2      2  Yolanda    NaN
3      3      Bob      1
4    NaN  Charlie      2
5    NaN    David      3

In [41]:
pd.merge(left=reg_df, right=log_df, how="left", on="name")

  reg_id     name log_id
0      0   Andrew      1
1      1      Bob      3
2      2  Charlie    NaN
3      3    David    NaN

In [43]:
pd.merge(left=reg_df, right=log_df, how="right", on="name")

  reg_id     name log_id
0    NaN   Xavier      0
1      0   Andrew      1
2    NaN  Yolanda      2
3      1      Bob      3

In [45]:
pd.merge(reg_df, log_df, how="outer", on="name")

  reg_id     name log_id
0      0   Andrew      1
1      1      Bob      3
2      2  Charlie    NaN
3      3    David    NaN
4    NaN   Xavier      0
5    NaN  Yolanda      2

In [62]:
reg_df = reg_df.set_index("name")

In [61]:
log_df = log_df.set_index("log_id")

In [63]:
pd.merge(reg_df, log_df, left_index=True, right_on="name", how="inner")

       reg_id    name
log_id
1           0  Andrew
3           1     Bob

In [64]:
reg_df = reg_df.reset_index()

In [65]:
reg_df

      name reg_id
0   Andrew      0
1      Bob      1
2  Charlie      2
3    David      3

In [66]:
reg_df.columns = ["reg_name","reg_id"]

In [67]:
reg_df

  reg_name reg_id
0   Andrew      0
1      Bob      1
2  Charlie      2
3    David      3

In [68]:
log_df

           name
log_id
0        Xavier
1        Andrew
2       Yolanda
3           Bob

In [71]:
results = pd.merge(reg_df, log_df, left_on="reg_name", right_on="name", how="inner")

In [72]:
results.drop("reg_name",axis=1)

  reg_id    name
0      0  Andrew
1      1     Bob

In [73]:
registrations = reg_df

In [75]:
registrations.columns = ["name","id"]

In [76]:
registrations

      name id
0   Andrew  0
1      Bob  1
2  Charlie  2
3    David  3

In [77]:
logins = log_df

In [82]:
logins

           name
log_id
0        Xavier
1        Andrew
2       Yolanda
3           Bob

In [83]:
logins.columns = ["id","name"]

ValueError: Length mismatch: Expected axis has 1 elements, new values have 2 elements

In [86]:
logins = logins.reset_index()

In [87]:
logins.columns = ["id","name"]

In [88]:
logins

  id     name
0  0   Xavier
1  1   Andrew
2  2  Yolanda
3  3      Bob

In [89]:
registrations

      name id
0   Andrew  0
1      Bob  1
2  Charlie  2
3    David  3

In [91]:
pd.merge(registrations, logins, how="inner",on="name",suffixes=("_reg","_log"))

     name id_reg id_log
0  Andrew      0      1
1     Bob      1      3